;******************************************************************************
;* TMS320C6x C/C++ Codegen                                          PC v6.0.1 *
;* Date/Time created: Tue Mar 07 22:08:38 2006                                *
;******************************************************************************
	.compiler_opts --endian=big --hll_source=on --mem_model:code=near --mem_model:data=far_aggregates --quiet --silicon_version=6500 --symdebug:dwarf 

;******************************************************************************
;* GLOBAL FILE PARAMETERS                                                     *
;*                                                                            *
;*   Architecture      : TMS320C64x+                                          *
;*   Optimization      : Disabled                                             *
;*   Optimizing for    : Compile time, Ease of Development                    *
;*                       Based on options: no -o, no -ms                      *
;*   Endian            : Big                                                  *
;*   Interrupt Thrshld : Disabled                                             *
;*   Data Access Model : Far Aggregate Data                                   *
;*   Pipelining        : Disabled                                             *
;*   Memory Aliases    : Presume are aliases (pessimistic)                    *

	.dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
$C$DW$T$199	.dwtag  DW_TAG_typedef, DW_AT_name("Int")
	.dwattr $C$DW$T$199, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$T$199, DW_AT_language(DW_LANG_C)
$C$DW$T$11	.dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
	.dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$11, DW_AT_byte_size(0x04)
$C$DW$T$19	.dwtag  DW_TAG_typedef, DW_AT_name("Uint32")
	.dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
$C$DW$T$20	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$19)

$C$DW$T$21	.dwtag  DW_TAG_array_type, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$21, DW_AT_byte_size(0x08)
$C$DW$273	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$273, DW_AT_upper_bound(0x01)
	.dwendtag $C$DW$T$21


$C$DW$T$22	.dwtag  DW_TAG_array_type, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$22, DW_AT_byte_size(0x20)
$C$DW$274	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$274, DW_AT_upper_bound(0x07)
	.dwendtag $C$DW$T$22


$C$DW$T$23	.dwtag  DW_TAG_array_type, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$23, DW_AT_byte_size(0x0c)
$C$DW$275	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$275, DW_AT_upper_bound(0x02)
	.dwendtag $C$DW$T$23


$C$DW$T$24	.dwtag  DW_TAG_array_type, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$24, DW_AT_byte_size(0x10)
$C$DW$276	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$276, DW_AT_upper_bound(0x03)
	.dwendtag $C$DW$T$24


$C$DW$T$25	.dwtag  DW_TAG_array_type, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$25, DW_AT_byte_size(0x30)
$C$DW$277	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$277, DW_AT_upper_bound(0x0b)
	.dwendtag $C$DW$T$25


$C$DW$T$26	.dwtag  DW_TAG_array_type, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$26, DW_AT_byte_size(0x40)
$C$DW$278	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$278, DW_AT_upper_bound(0x0f)
	.dwendtag $C$DW$T$26


$C$DW$T$75	.dwtag  DW_TAG_array_type, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$75, DW_AT_byte_size(0x100)
$C$DW$279	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$279, DW_AT_upper_bound(0x3f)
	.dwendtag $C$DW$T$75


$C$DW$T$122	.dwtag  DW_TAG_array_type, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$122, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$122, DW_AT_byte_size(0xa4)
$C$DW$280	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$280, DW_AT_upper_bound(0x28)
	.dwendtag $C$DW$T$122


$C$DW$T$133	.dwtag  DW_TAG_array_type, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$133, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$133, DW_AT_byte_size(0x80)
$C$DW$281	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$281, DW_AT_upper_bound(0x1f)
	.dwendtag $C$DW$T$133


$C$DW$T$143	.dwtag  DW_TAG_array_type, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$143, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$143, DW_AT_byte_size(0x18)
$C$DW$282	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$282, DW_AT_upper_bound(0x05)
	.dwendtag $C$DW$T$143

$C$DW$T$200	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_Reg32")
	.dwattr $C$DW$T$200, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$200, DW_AT_language(DW_LANG_C)

$C$DW$T$39	.dwtag  DW_TAG_array_type, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$39, DW_AT_byte_size(0x18)
$C$DW$283	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$283, DW_AT_upper_bound(0x05)
	.dwendtag $C$DW$T$39


$C$DW$T$146	.dwtag  DW_TAG_array_type, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$146, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$146, DW_AT_byte_size(0x40)
$C$DW$284	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$284, DW_AT_upper_bound(0x0f)
	.dwendtag $C$DW$T$146

$C$DW$T$152	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_BitMask32")
	.dwattr $C$DW$T$152, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$152, DW_AT_language(DW_LANG_C)
$C$DW$T$202	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_Xio")
	.dwattr $C$DW$T$202, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$202, DW_AT_language(DW_LANG_C)
$C$DW$T$204	.dwtag  DW_TAG_typedef, DW_AT_name("Uns")
	.dwattr $C$DW$T$204, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$T$204, DW_AT_language(DW_LANG_C)
$C$DW$T$12	.dwtag  DW_TAG_base_type, DW_AT_name("long")
	.dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$12, DW_AT_byte_size(0x08)
	.dwattr $C$DW$T$12, DW_AT_bit_size(0x28)
	.dwattr $C$DW$T$12, DW_AT_bit_offset(0x18)
$C$DW$T$13	.dwtag  DW_TAG_base_type, DW_AT_name("unsigned long")
	.dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$13, DW_AT_byte_size(0x08)
	.dwattr $C$DW$T$13, DW_AT_bit_size(0x28)
	.dwattr $C$DW$T$13, DW_AT_bit_offset(0x18)
$C$DW$T$14	.dwtag  DW_TAG_base_type, DW_AT_name("long long")
	.dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$14, DW_AT_byte_size(0x08)
$C$DW$T$15	.dwtag  DW_TAG_base_type, DW_AT_name("unsigned long long")
	.dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$15, DW_AT_byte_size(0x08)
$C$DW$T$16	.dwtag  DW_TAG_base_type, DW_AT_name("float")
	.dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$16, DW_AT_byte_size(0x04)
$C$DW$T$17	.dwtag  DW_TAG_base_type, DW_AT_name("double")
	.dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$17, DW_AT_byte_size(0x08)
$C$DW$T$18	.dwtag  DW_TAG_base_type, DW_AT_name("long double")
	.dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$18, DW_AT_byte_size(0x08)

$C$DW$T$27	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$27, DW_AT_byte_size(0x2c0)
$C$DW$285	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$285, DW_AT_name("PID")
	.dwattr $C$DW$285, DW_AT_TI_symbol_name("_PID")
	.dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$286	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$286, DW_AT_name("PWRDEMU")
	.dwattr $C$DW$286, DW_AT_TI_symbol_name("_PWRDEMU")
	.dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$287	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$287, DW_AT_name("RSVD0")
	.dwattr $C$DW$287, DW_AT_TI_symbol_name("_RSVD0")
	.dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$288	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$288, DW_AT_name("PFUNC")
	.dwattr $C$DW$288, DW_AT_TI_symbol_name("_PFUNC")
	.dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$289	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$289, DW_AT_name("PDIR")
	.dwattr $C$DW$289, DW_AT_TI_symbol_name("_PDIR")
	.dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$290	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$290, DW_AT_name("PDOUT")
	.dwattr $C$DW$290, DW_AT_TI_symbol_name("_PDOUT")
	.dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$291	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$291, DW_AT_name("PDIN_PDSET")
	.dwattr $C$DW$291, DW_AT_TI_symbol_name("_PDIN_PDSET")
	.dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$292	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$292, DW_AT_name("PDCLR")
	.dwattr $C$DW$292, DW_AT_TI_symbol_name("_PDCLR")
	.dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$293	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$293, DW_AT_name("RSVD1")
	.dwattr $C$DW$293, DW_AT_TI_symbol_name("_RSVD1")
	.dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$294	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$294, DW_AT_name("GBLCTL")
	.dwattr $C$DW$294, DW_AT_TI_symbol_name("_GBLCTL")
	.dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$295	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$295, DW_AT_name("AMUTE")
	.dwattr $C$DW$295, DW_AT_TI_symbol_name("_AMUTE")
	.dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$296	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$296, DW_AT_name("DLBCTL")
	.dwattr $C$DW$296, DW_AT_TI_symbol_name("_DLBCTL")
	.dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
	.dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$297	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$297, DW_AT_name("DITCTL")
	.dwattr $C$DW$297, DW_AT_TI_symbol_name("_DITCTL")
	.dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$298	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$298, DW_AT_name("RSVD2")
	.dwattr $C$DW$298, DW_AT_TI_symbol_name("_RSVD2")
	.dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
	.dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$299	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$299, DW_AT_name("RGBLCTL")
	.dwattr $C$DW$299, DW_AT_TI_symbol_name("_RGBLCTL")
	.dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
	.dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$300	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$300, DW_AT_name("RMASK")
	.dwattr $C$DW$300, DW_AT_TI_symbol_name("_RMASK")
	.dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
	.dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$301	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$301, DW_AT_name("RFMT")
	.dwattr $C$DW$301, DW_AT_TI_symbol_name("_RFMT")
	.dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
	.dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$302	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$302, DW_AT_name("AFSRCTL")
	.dwattr $C$DW$302, DW_AT_TI_symbol_name("_AFSRCTL")
	.dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
	.dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$303	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$303, DW_AT_name("ACLKRCTL")
	.dwattr $C$DW$303, DW_AT_TI_symbol_name("_ACLKRCTL")
	.dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
	.dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$304	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$304, DW_AT_name("AHCLKRCTL")
	.dwattr $C$DW$304, DW_AT_TI_symbol_name("_AHCLKRCTL")
	.dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
	.dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$305	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$305, DW_AT_name("RTDM")
	.dwattr $C$DW$305, DW_AT_TI_symbol_name("_RTDM")
	.dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
	.dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$306	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$306, DW_AT_name("RINTCTL")
	.dwattr $C$DW$306, DW_AT_TI_symbol_name("_RINTCTL")
	.dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
	.dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$307	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$307, DW_AT_name("RSTAT")
	.dwattr $C$DW$307, DW_AT_TI_symbol_name("_RSTAT")
	.dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
	.dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$308	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$308, DW_AT_name("RSLOT")
	.dwattr $C$DW$308, DW_AT_TI_symbol_name("_RSLOT")
	.dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
	.dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$309	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$309, DW_AT_name("RCLKCHK")
	.dwattr $C$DW$309, DW_AT_TI_symbol_name("_RCLKCHK")
	.dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
	.dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$310	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$310, DW_AT_name("REVTCTL")
	.dwattr $C$DW$310, DW_AT_TI_symbol_name("_REVTCTL")
	.dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x8c]
	.dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$311	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$311, DW_AT_name("RSVD3")
	.dwattr $C$DW$311, DW_AT_TI_symbol_name("_RSVD3")
	.dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
	.dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$312	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$312, DW_AT_name("XGBLCTL")
	.dwattr $C$DW$312, DW_AT_TI_symbol_name("_XGBLCTL")
	.dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
	.dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$313	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$313, DW_AT_name("XMASK")
	.dwattr $C$DW$313, DW_AT_TI_symbol_name("_XMASK")
	.dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
	.dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$314	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$314, DW_AT_name("XFMT")
	.dwattr $C$DW$314, DW_AT_TI_symbol_name("_XFMT")
	.dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
	.dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$315	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$315, DW_AT_name("AFSXCTL")
	.dwattr $C$DW$315, DW_AT_TI_symbol_name("_AFSXCTL")
	.dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0xac]
	.dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$316	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$316, DW_AT_name("ACLKXCTL")
	.dwattr $C$DW$316, DW_AT_TI_symbol_name("_ACLKXCTL")
	.dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
	.dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$317	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$317, DW_AT_name("AHCLKXCTL")
	.dwattr $C$DW$317, DW_AT_TI_symbol_name("_AHCLKXCTL")
	.dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0xb4]
	.dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$318	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$318, DW_AT_name("XTDM")
	.dwattr $C$DW$318, DW_AT_TI_symbol_name("_XTDM")
	.dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0xb8]
	.dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$319	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$319, DW_AT_name("XINTCTL")
	.dwattr $C$DW$319, DW_AT_TI_symbol_name("_XINTCTL")
	.dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
	.dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$320	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$320, DW_AT_name("XSTAT")
	.dwattr $C$DW$320, DW_AT_TI_symbol_name("_XSTAT")
	.dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
	.dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$321	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$321, DW_AT_name("XSLOT")
	.dwattr $C$DW$321, DW_AT_TI_symbol_name("_XSLOT")
	.dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
	.dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$322	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$322, DW_AT_name("XCLKCHK")
	.dwattr $C$DW$322, DW_AT_TI_symbol_name("_XCLKCHK")
	.dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
	.dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$323	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$323, DW_AT_name("XEVTCTL")
	.dwattr $C$DW$323, DW_AT_TI_symbol_name("_XEVTCTL")
	.dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
	.dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$324	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$324, DW_AT_name("RSVD4")
	.dwattr $C$DW$324, DW_AT_TI_symbol_name("_RSVD4")
	.dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
	.dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$325	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$325, DW_AT_name("DITCSRA0")
	.dwattr $C$DW$325, DW_AT_TI_symbol_name("_DITCSRA0")
	.dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
	.dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$326	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$326, DW_AT_name("DITCSRA1")
	.dwattr $C$DW$326, DW_AT_TI_symbol_name("_DITCSRA1")
	.dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
	.dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$327	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$327, DW_AT_name("DITCSRA2")
	.dwattr $C$DW$327, DW_AT_TI_symbol_name("_DITCSRA2")
	.dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x108]
	.dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$328	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$328, DW_AT_name("DITCSRA3")
	.dwattr $C$DW$328, DW_AT_TI_symbol_name("_DITCSRA3")
	.dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x10c]
	.dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$329	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$329, DW_AT_name("DITCSRA4")
	.dwattr $C$DW$329, DW_AT_TI_symbol_name("_DITCSRA4")
	.dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x110]
	.dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$330	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$330, DW_AT_name("DITCSRA5")
	.dwattr $C$DW$330, DW_AT_TI_symbol_name("_DITCSRA5")
	.dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x114]
	.dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$331	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$331, DW_AT_name("DITCSRB0")
	.dwattr $C$DW$331, DW_AT_TI_symbol_name("_DITCSRB0")
	.dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x118]
	.dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$332	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$332, DW_AT_name("DITCSRB1")
	.dwattr $C$DW$332, DW_AT_TI_symbol_name("_DITCSRB1")
	.dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x11c]
	.dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$333	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$333, DW_AT_name("DITCSRB2")
	.dwattr $C$DW$333, DW_AT_TI_symbol_name("_DITCSRB2")
	.dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x120]
	.dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$334	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$334, DW_AT_name("DITCSRB3")
	.dwattr $C$DW$334, DW_AT_TI_symbol_name("_DITCSRB3")
	.dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x124]
	.dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$335	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$335, DW_AT_name("DITCSRB4")
	.dwattr $C$DW$335, DW_AT_TI_symbol_name("_DITCSRB4")
	.dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x128]
	.dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$336	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$336, DW_AT_name("DITCSRB5")
	.dwattr $C$DW$336, DW_AT_TI_symbol_name("_DITCSRB5")
	.dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x12c]
	.dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$337	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$337, DW_AT_name("DITUDRA0")
	.dwattr $C$DW$337, DW_AT_TI_symbol_name("_DITUDRA0")
	.dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x130]
	.dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$338	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$338, DW_AT_name("DITUDRA1")
	.dwattr $C$DW$338, DW_AT_TI_symbol_name("_DITUDRA1")
	.dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x134]
	.dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$339	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$339, DW_AT_name("DITUDRA2")
	.dwattr $C$DW$339, DW_AT_TI_symbol_name("_DITUDRA2")
	.dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x138]
	.dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$340	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$340, DW_AT_name("DITUDRA3")
	.dwattr $C$DW$340, DW_AT_TI_symbol_name("_DITUDRA3")
	.dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x13c]
	.dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$341	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$341, DW_AT_name("DITUDRA4")
	.dwattr $C$DW$341, DW_AT_TI_symbol_name("_DITUDRA4")
	.dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x140]
	.dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$342	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$342, DW_AT_name("DITUDRA5")
	.dwattr $C$DW$342, DW_AT_TI_symbol_name("_DITUDRA5")
	.dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x144]
	.dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$343	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$343, DW_AT_name("DITUDRB0")
	.dwattr $C$DW$343, DW_AT_TI_symbol_name("_DITUDRB0")
	.dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x148]
	.dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$344	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$344, DW_AT_name("DITUDRB1")
	.dwattr $C$DW$344, DW_AT_TI_symbol_name("_DITUDRB1")
	.dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x14c]
	.dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$345	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$345, DW_AT_name("DITUDRB2")
	.dwattr $C$DW$345, DW_AT_TI_symbol_name("_DITUDRB2")
	.dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x150]
	.dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$346	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$346, DW_AT_name("DITUDRB3")
	.dwattr $C$DW$346, DW_AT_TI_symbol_name("_DITUDRB3")
	.dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x154]
	.dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$347	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$347, DW_AT_name("DITUDRB4")
	.dwattr $C$DW$347, DW_AT_TI_symbol_name("_DITUDRB4")
	.dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x158]
	.dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$348	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$348, DW_AT_name("DITUDRB5")
	.dwattr $C$DW$348, DW_AT_TI_symbol_name("_DITUDRB5")
	.dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x15c]
	.dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$349	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$349, DW_AT_name("RSVD5")
	.dwattr $C$DW$349, DW_AT_TI_symbol_name("_RSVD5")
	.dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x160]
	.dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$350	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$350, DW_AT_name("SRCTL0")
	.dwattr $C$DW$350, DW_AT_TI_symbol_name("_SRCTL0")
	.dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x180]
	.dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$351	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$351, DW_AT_name("SRCTL1")
	.dwattr $C$DW$351, DW_AT_TI_symbol_name("_SRCTL1")
	.dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x184]
	.dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$352	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$352, DW_AT_name("SRCTL2")
	.dwattr $C$DW$352, DW_AT_TI_symbol_name("_SRCTL2")
	.dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x188]
	.dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$353	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$353, DW_AT_name("SRCTL3")
	.dwattr $C$DW$353, DW_AT_TI_symbol_name("_SRCTL3")
	.dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x18c]
	.dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$354	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$354, DW_AT_name("SRCTL4")
	.dwattr $C$DW$354, DW_AT_TI_symbol_name("_SRCTL4")
	.dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x190]
	.dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$355	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$355, DW_AT_name("SRCTL5")
	.dwattr $C$DW$355, DW_AT_TI_symbol_name("_SRCTL5")
	.dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x194]
	.dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$356	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$356, DW_AT_name("SRCTL6")
	.dwattr $C$DW$356, DW_AT_TI_symbol_name("_SRCTL6")
	.dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x198]
	.dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$357	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$357, DW_AT_name("SRCTL7")
	.dwattr $C$DW$357, DW_AT_TI_symbol_name("_SRCTL7")
	.dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x19c]
	.dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$358	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$358, DW_AT_name("SRCTL8")
	.dwattr $C$DW$358, DW_AT_TI_symbol_name("_SRCTL8")
	.dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a0]
	.dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$359	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$359, DW_AT_name("SRCTL9")
	.dwattr $C$DW$359, DW_AT_TI_symbol_name("_SRCTL9")
	.dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a4]
	.dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$360	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$360, DW_AT_name("SRCTL10")
	.dwattr $C$DW$360, DW_AT_TI_symbol_name("_SRCTL10")
	.dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a8]
	.dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$361	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$361, DW_AT_name("SRCTL11")
	.dwattr $C$DW$361, DW_AT_TI_symbol_name("_SRCTL11")
	.dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x1ac]
	.dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$362	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$362, DW_AT_name("SRCTL12")
	.dwattr $C$DW$362, DW_AT_TI_symbol_name("_SRCTL12")
	.dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b0]
	.dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$363	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$363, DW_AT_name("SRCTL13")
	.dwattr $C$DW$363, DW_AT_TI_symbol_name("_SRCTL13")
	.dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b4]
	.dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$364	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$364, DW_AT_name("SRCTL14")
	.dwattr $C$DW$364, DW_AT_TI_symbol_name("_SRCTL14")
	.dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b8]
	.dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$365	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$365, DW_AT_name("SRCTL15")
	.dwattr $C$DW$365, DW_AT_TI_symbol_name("_SRCTL15")
	.dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x1bc]
	.dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$366	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$366, DW_AT_name("RSVD6")
	.dwattr $C$DW$366, DW_AT_TI_symbol_name("_RSVD6")
	.dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c0]
	.dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$367	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$367, DW_AT_name("XBUF0")
	.dwattr $C$DW$367, DW_AT_TI_symbol_name("_XBUF0")
	.dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x200]
	.dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$368	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$368, DW_AT_name("XBUF1")
	.dwattr $C$DW$368, DW_AT_TI_symbol_name("_XBUF1")
	.dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x204]
	.dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$369	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$369, DW_AT_name("XBUF2")
	.dwattr $C$DW$369, DW_AT_TI_symbol_name("_XBUF2")
	.dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x208]
	.dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$370	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$370, DW_AT_name("XBUF3")
	.dwattr $C$DW$370, DW_AT_TI_symbol_name("_XBUF3")
	.dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x20c]
	.dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$371	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$371, DW_AT_name("XBUF4")
	.dwattr $C$DW$371, DW_AT_TI_symbol_name("_XBUF4")
	.dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x210]
	.dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$372	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$372, DW_AT_name("XBUF5")
	.dwattr $C$DW$372, DW_AT_TI_symbol_name("_XBUF5")
	.dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x214]
	.dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$373	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$373, DW_AT_name("XBUF6")
	.dwattr $C$DW$373, DW_AT_TI_symbol_name("_XBUF6")
	.dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x218]
	.dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$374	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$374, DW_AT_name("XBUF7")
	.dwattr $C$DW$374, DW_AT_TI_symbol_name("_XBUF7")
	.dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x21c]
	.dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$375	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$375, DW_AT_name("XBUF8")
	.dwattr $C$DW$375, DW_AT_TI_symbol_name("_XBUF8")
	.dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x220]
	.dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$376	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$376, DW_AT_name("XBUF9")
	.dwattr $C$DW$376, DW_AT_TI_symbol_name("_XBUF9")
	.dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x224]
	.dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$377	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$377, DW_AT_name("XBUF10")
	.dwattr $C$DW$377, DW_AT_TI_symbol_name("_XBUF10")
	.dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x228]
	.dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$378	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$378, DW_AT_name("XBUF11")
	.dwattr $C$DW$378, DW_AT_TI_symbol_name("_XBUF11")
	.dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x22c]
	.dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$379	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$379, DW_AT_name("XBUF12")
	.dwattr $C$DW$379, DW_AT_TI_symbol_name("_XBUF12")
	.dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x230]
	.dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$380	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$380, DW_AT_name("XBUF13")
	.dwattr $C$DW$380, DW_AT_TI_symbol_name("_XBUF13")
	.dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x234]
	.dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$381	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$381, DW_AT_name("XBUF14")
	.dwattr $C$DW$381, DW_AT_TI_symbol_name("_XBUF14")
	.dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x238]
	.dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$382	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$382, DW_AT_name("XBUF15")
	.dwattr $C$DW$382, DW_AT_TI_symbol_name("_XBUF15")
	.dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x23c]
	.dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$383	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$383, DW_AT_name("RSVD7")
	.dwattr $C$DW$383, DW_AT_TI_symbol_name("_RSVD7")
	.dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x240]
	.dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$384	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$384, DW_AT_name("RBUF0")
	.dwattr $C$DW$384, DW_AT_TI_symbol_name("_RBUF0")
	.dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x280]
	.dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$385	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$385, DW_AT_name("RBUF1")
	.dwattr $C$DW$385, DW_AT_TI_symbol_name("_RBUF1")
	.dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x284]
	.dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$386	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$386, DW_AT_name("RBUF2")
	.dwattr $C$DW$386, DW_AT_TI_symbol_name("_RBUF2")
	.dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x288]
	.dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$387	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$387, DW_AT_name("RBUF3")
	.dwattr $C$DW$387, DW_AT_TI_symbol_name("_RBUF3")
	.dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x28c]
	.dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$388	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$388, DW_AT_name("RBUF4")
	.dwattr $C$DW$388, DW_AT_TI_symbol_name("_RBUF4")
	.dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x290]
	.dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$389	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$389, DW_AT_name("RBUF5")
	.dwattr $C$DW$389, DW_AT_TI_symbol_name("_RBUF5")
	.dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x294]
	.dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$390	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$390, DW_AT_name("RBUF6")
	.dwattr $C$DW$390, DW_AT_TI_symbol_name("_RBUF6")
	.dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x298]
	.dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$391	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$391, DW_AT_name("RBUF7")
	.dwattr $C$DW$391, DW_AT_TI_symbol_name("_RBUF7")
	.dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x29c]
	.dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$392	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$392, DW_AT_name("RBUF8")
	.dwattr $C$DW$392, DW_AT_TI_symbol_name("_RBUF8")
	.dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a0]
	.dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$393	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$393, DW_AT_name("RBUF9")
	.dwattr $C$DW$393, DW_AT_TI_symbol_name("_RBUF9")
	.dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a4]
	.dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$394	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$394, DW_AT_name("RBUF10")
	.dwattr $C$DW$394, DW_AT_TI_symbol_name("_RBUF10")
	.dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a8]
	.dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$395	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$395, DW_AT_name("RBUF11")
	.dwattr $C$DW$395, DW_AT_TI_symbol_name("_RBUF11")
	.dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x2ac]
	.dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$396	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$396, DW_AT_name("RBUF12")
	.dwattr $C$DW$396, DW_AT_TI_symbol_name("_RBUF12")
	.dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b0]
	.dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$397	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$397, DW_AT_name("RBUF13")
	.dwattr $C$DW$397, DW_AT_TI_symbol_name("_RBUF13")
	.dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b4]
	.dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$398	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$398, DW_AT_name("RBUF14")
	.dwattr $C$DW$398, DW_AT_TI_symbol_name("_RBUF14")
	.dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b8]
	.dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$399	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$399, DW_AT_name("RBUF15")
	.dwattr $C$DW$399, DW_AT_TI_symbol_name("_RBUF15")
	.dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x2bc]
	.dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$27

$C$DW$T$28	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_McaspRegs")
	.dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
$C$DW$T$29	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
$C$DW$T$30	.dwtag  DW_TAG_pointer_type, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$T$30, DW_AT_address_class(0x20)
$C$DW$T$31	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_McaspRegsOvly")
	.dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)

$C$DW$T$35	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$35, DW_AT_name("CSL_McaspObj")
	.dwattr $C$DW$T$35, DW_AT_byte_size(0x10)
$C$DW$400	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$400, DW_AT_name("regs")
	.dwattr $C$DW$400, DW_AT_TI_symbol_name("_regs")
	.dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$401	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$401, DW_AT_name("perNo")
	.dwattr $C$DW$401, DW_AT_TI_symbol_name("_perNo")
	.dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$402	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$402, DW_AT_name("numOfSerializers")
	.dwattr $C$DW$402, DW_AT_TI_symbol_name("_numOfSerializers")
	.dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$403	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$403, DW_AT_name("ditStatus")
	.dwattr $C$DW$403, DW_AT_TI_symbol_name("_ditStatus")
	.dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$35

$C$DW$T$163	.dwtag  DW_TAG_pointer_type, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$T$163, DW_AT_address_class(0x20)
$C$DW$T$164	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_McaspHandle")
	.dwattr $C$DW$T$164, DW_AT_type(*$C$DW$T$163)
	.dwattr $C$DW$T$164, DW_AT_language(DW_LANG_C)
$C$DW$T$205	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_McaspObj")
	.dwattr $C$DW$T$205, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$T$205, DW_AT_language(DW_LANG_C)

$C$DW$T$36	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$36, DW_AT_name("CSL_McaspHwSetupDataClk")
	.dwattr $C$DW$T$36, DW_AT_byte_size(0x0c)
$C$DW$404	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$404, DW_AT_name("clkSetupClk")
	.dwattr $C$DW$404, DW_AT_TI_symbol_name("_clkSetupClk")
	.dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$405	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$405, DW_AT_name("clkSetupHiClk")
	.dwattr $C$DW$405, DW_AT_TI_symbol_name("_clkSetupHiClk")
	.dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$406	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$406, DW_AT_name("clkChk")
	.dwattr $C$DW$406, DW_AT_TI_symbol_name("_clkChk")
	.dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$36

$C$DW$T$37	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_McaspHwSetupDataClk")
	.dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
$C$DW$T$171	.dwtag  DW_TAG_pointer_type, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$T$171, DW_AT_address_class(0x20)

$C$DW$T$38	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$38, DW_AT_name("CSL_McaspHwSetupData")
	.dwattr $C$DW$T$38, DW_AT_byte_size(0x28)
$C$DW$407	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$407, DW_AT_name("mask")
	.dwattr $C$DW$407, DW_AT_TI_symbol_name("_mask")
	.dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$408	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$408, DW_AT_name("fmt")
	.dwattr $C$DW$408, DW_AT_TI_symbol_name("_fmt")
	.dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$409	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$409, DW_AT_name("frSyncCtl")
	.dwattr $C$DW$409, DW_AT_TI_symbol_name("_frSyncCtl")
	.dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$410	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$410, DW_AT_name("tdm")
	.dwattr $C$DW$410, DW_AT_TI_symbol_name("_tdm")
	.dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$411	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$411, DW_AT_name("intCtl")
	.dwattr $C$DW$411, DW_AT_TI_symbol_name("_intCtl")
	.dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$412	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$412, DW_AT_name("stat")
	.dwattr $C$DW$412, DW_AT_TI_symbol_name("_stat")
	.dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$413	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$413, DW_AT_name("evtCtl")
	.dwattr $C$DW$413, DW_AT_TI_symbol_name("_evtCtl")
	.dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$414	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$414, DW_AT_name("clk")
	.dwattr $C$DW$414, DW_AT_TI_symbol_name("_clk")
	.dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$38

$C$DW$T$149	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_McaspHwSetupData")
	.dwattr $C$DW$T$149, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$T$149, DW_AT_language(DW_LANG_C)
$C$DW$T$174	.dwtag  DW_TAG_pointer_type, DW_AT_type(*$C$DW$T$149)
	.dwattr $C$DW$T$174, DW_AT_address_class(0x20)

$C$DW$T$40	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$40, DW_AT_byte_size(0x30)
$C$DW$415	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$415, DW_AT_name("chStatusLeft")
	.dwattr $C$DW$415, DW_AT_TI_symbol_name("_chStatusLeft")
	.dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$416	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$416, DW_AT_name("chStatusRight")
	.dwattr $C$DW$416, DW_AT_TI_symbol_name("_chStatusRight")
	.dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$40

$C$DW$T$179	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_McaspChStatusRam")
	.dwattr $C$DW$T$179, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$T$179, DW_AT_language(DW_LANG_C)
$C$DW$T$180	.dwtag  DW_TAG_pointer_type, DW_AT_type(*$C$DW$T$179)
	.dwattr $C$DW$T$180, DW_AT_address_class(0x20)

$C$DW$T$41	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$41, DW_AT_byte_size(0x30)
$C$DW$417	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$417, DW_AT_name("userDataLeft")
	.dwattr $C$DW$417, DW_AT_TI_symbol_name("_userDataLeft")
	.dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$418	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$418, DW_AT_name("userDataRight")
	.dwattr $C$DW$418, DW_AT_TI_symbol_name("_userDataRight")
	.dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$41

$C$DW$T$183	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_McaspUserDataRam")
	.dwattr $C$DW$T$183, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$T$183, DW_AT_language(DW_LANG_C)
$C$DW$T$184	.dwtag  DW_TAG_pointer_type, DW_AT_type(*$C$DW$T$183)
	.dwattr $C$DW$T$184, DW_AT_address_class(0x20)

$C$DW$T$42	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$42, DW_AT_byte_size(0x34)
$C$DW$419	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$419, DW_AT_name("RBR")
	.dwattr $C$DW$419, DW_AT_TI_symbol_name("_RBR")
	.dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$420	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$420, DW_AT_name("IER")
	.dwattr $C$DW$420, DW_AT_TI_symbol_name("_IER")
	.dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$421	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$421, DW_AT_name("IIR")
	.dwattr $C$DW$421, DW_AT_TI_symbol_name("_IIR")
	.dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$422	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$422, DW_AT_name("LCR")
	.dwattr $C$DW$422, DW_AT_TI_symbol_name("_LCR")
	.dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$423	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$423, DW_AT_name("MCR")
	.dwattr $C$DW$423, DW_AT_TI_symbol_name("_MCR")
	.dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$424	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$424, DW_AT_name("LSR")
	.dwattr $C$DW$424, DW_AT_TI_symbol_name("_LSR")
	.dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$425	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$425, DW_AT_name("MSR")
	.dwattr $C$DW$425, DW_AT_TI_symbol_name("_MSR")
	.dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$426	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$426, DW_AT_name("SCR")
	.dwattr $C$DW$426, DW_AT_TI_symbol_name("_SCR")
	.dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$427	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$427, DW_AT_name("DLL")
	.dwattr $C$DW$427, DW_AT_TI_symbol_name("_DLL")
	.dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$428	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$428, DW_AT_name("DLH")
	.dwattr $C$DW$428, DW_AT_TI_symbol_name("_DLH")
	.dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$429	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$429, DW_AT_name("PID1")
	.dwattr $C$DW$429, DW_AT_TI_symbol_name("_PID1")
	.dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$430	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$430, DW_AT_name("PID2")
	.dwattr $C$DW$430, DW_AT_TI_symbol_name("_PID2")
	.dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$431	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$431, DW_AT_name("PWREMU_MGMT")
	.dwattr $C$DW$431, DW_AT_TI_symbol_name("_PWREMU_MGMT")
	.dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$42

$C$DW$T$217	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UartRegs")
	.dwattr $C$DW$T$217, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$T$217, DW_AT_language(DW_LANG_C)
$C$DW$T$218	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$218, DW_AT_type(*$C$DW$T$217)
$C$DW$T$219	.dwtag  DW_TAG_pointer_type, DW_AT_type(*$C$DW$T$218)
	.dwattr $C$DW$T$219, DW_AT_address_class(0x20)
$C$DW$T$220	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UartRegsOvly")
	.dwattr $C$DW$T$220, DW_AT_type(*$C$DW$T$219)
	.dwattr $C$DW$T$220, DW_AT_language(DW_LANG_C)

$C$DW$T$49	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$49, DW_AT_byte_size(0x60)
$C$DW$432	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$432, DW_AT_name("ICOAR")
	.dwattr $C$DW$432, DW_AT_TI_symbol_name("_ICOAR")
	.dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$433	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$433, DW_AT_name("RSVD0")
	.dwattr $C$DW$433, DW_AT_TI_symbol_name("_RSVD0")
	.dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$434	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$434, DW_AT_name("ICIMR")
	.dwattr $C$DW$434, DW_AT_TI_symbol_name("_ICIMR")
	.dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$435	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$435, DW_AT_name("RSVD1")
	.dwattr $C$DW$435, DW_AT_TI_symbol_name("_RSVD1")
	.dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$436	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$436, DW_AT_name("ICSTR")
	.dwattr $C$DW$436, DW_AT_TI_symbol_name("_ICSTR")
	.dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$437	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$437, DW_AT_name("RSVD2")
	.dwattr $C$DW$437, DW_AT_TI_symbol_name("_RSVD2")
	.dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$438	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$438, DW_AT_name("ICCLKL")
	.dwattr $C$DW$438, DW_AT_TI_symbol_name("_ICCLKL")
	.dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$439	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$439, DW_AT_name("RSVD3")
	.dwattr $C$DW$439, DW_AT_TI_symbol_name("_RSVD3")
	.dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$440	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$440, DW_AT_name("ICCLKH")
	.dwattr $C$DW$440, DW_AT_TI_symbol_name("_ICCLKH")
	.dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$441	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$441, DW_AT_name("RSVD4")
	.dwattr $C$DW$441, DW_AT_TI_symbol_name("_RSVD4")
	.dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$442	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$442, DW_AT_name("ICCNT")
	.dwattr $C$DW$442, DW_AT_TI_symbol_name("_ICCNT")
	.dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$443	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$443, DW_AT_name("RSVD5")
	.dwattr $C$DW$443, DW_AT_TI_symbol_name("_RSVD5")
	.dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$444	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$444, DW_AT_name("ICDRR")
	.dwattr $C$DW$444, DW_AT_TI_symbol_name("_ICDRR")
	.dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$445	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$445, DW_AT_name("RSVD6")
	.dwattr $C$DW$445, DW_AT_TI_symbol_name("_RSVD6")
	.dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$446	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$446, DW_AT_name("ICSAR")
	.dwattr $C$DW$446, DW_AT_TI_symbol_name("_ICSAR")
	.dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$447	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$447, DW_AT_name("RSVD7")
	.dwattr $C$DW$447, DW_AT_TI_symbol_name("_RSVD7")
	.dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$448	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$448, DW_AT_name("ICDXR")
	.dwattr $C$DW$448, DW_AT_TI_symbol_name("_ICDXR")
	.dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$449	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$449, DW_AT_name("RSVD8")
	.dwattr $C$DW$449, DW_AT_TI_symbol_name("_RSVD8")
	.dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$450	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$450, DW_AT_name("ICMDR")
	.dwattr $C$DW$450, DW_AT_TI_symbol_name("_ICMDR")
	.dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$451	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$451, DW_AT_name("RSVD9")
	.dwattr $C$DW$451, DW_AT_TI_symbol_name("_RSVD9")
	.dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
	.dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$452	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$452, DW_AT_name("ICIVR")
	.dwattr $C$DW$452, DW_AT_TI_symbol_name("_ICIVR")
	.dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$453	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$453, DW_AT_name("RSVD10")
	.dwattr $C$DW$453, DW_AT_TI_symbol_name("_RSVD10")
	.dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$454	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$454, DW_AT_name("ICEMDR")
	.dwattr $C$DW$454, DW_AT_TI_symbol_name("_ICEMDR")
	.dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$455	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$455, DW_AT_name("RSVD11")
	.dwattr $C$DW$455, DW_AT_TI_symbol_name("_RSVD11")
	.dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
	.dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$456	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$456, DW_AT_name("ICPSC")
	.dwattr $C$DW$456, DW_AT_TI_symbol_name("_ICPSC")
	.dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$457	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$457, DW_AT_name("RSVD12")
	.dwattr $C$DW$457, DW_AT_TI_symbol_name("_RSVD12")
	.dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
	.dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$458	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$458, DW_AT_name("ICPID1")
	.dwattr $C$DW$458, DW_AT_TI_symbol_name("_ICPID1")
	.dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$459	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$459, DW_AT_name("RSVD13")
	.dwattr $C$DW$459, DW_AT_TI_symbol_name("_RSVD13")
	.dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
	.dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$460	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$460, DW_AT_name("ICPID2")
	.dwattr $C$DW$460, DW_AT_TI_symbol_name("_ICPID2")
	.dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$461	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$461, DW_AT_name("RSVD14")
	.dwattr $C$DW$461, DW_AT_TI_symbol_name("_RSVD14")
	.dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
	.dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$462	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$462, DW_AT_name("ICPFUNC")
	.dwattr $C$DW$462, DW_AT_TI_symbol_name("_ICPFUNC")
	.dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$463	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$463, DW_AT_name("ICPDIR")
	.dwattr $C$DW$463, DW_AT_TI_symbol_name("_ICPDIR")
	.dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
	.dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$464	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$464, DW_AT_name("ICPDIN")
	.dwattr $C$DW$464, DW_AT_TI_symbol_name("_ICPDIN")
	.dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$465	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$465, DW_AT_name("ICPDOUT")
	.dwattr $C$DW$465, DW_AT_TI_symbol_name("_ICPDOUT")
	.dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
	.dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$466	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$466, DW_AT_name("ICPDSET")
	.dwattr $C$DW$466, DW_AT_TI_symbol_name("_ICPDSET")
	.dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
	.dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$467	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$467, DW_AT_name("ICPDCLR")
	.dwattr $C$DW$467, DW_AT_TI_symbol_name("_ICPDCLR")
	.dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
	.dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$49

$C$DW$T$221	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2cRegs")
	.dwattr $C$DW$T$221, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$T$221, DW_AT_language(DW_LANG_C)
$C$DW$T$222	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$222, DW_AT_type(*$C$DW$T$221)
$C$DW$T$223	.dwtag  DW_TAG_pointer_type, DW_AT_type(*$C$DW$T$222)
	.dwattr $C$DW$T$223, DW_AT_address_class(0x20)
$C$DW$T$224	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2cRegsOvly")
	.dwattr $C$DW$T$224, DW_AT_type(*$C$DW$T$223)
	.dwattr $C$DW$T$224, DW_AT_language(DW_LANG_C)

$C$DW$T$50	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$50, DW_AT_byte_size(0x1c)
$C$DW$468	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$468, DW_AT_name("PID")
	.dwattr $C$DW$468, DW_AT_TI_symbol_name("_PID")
	.dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$469	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$469, DW_AT_name("PCR")
	.dwattr $C$DW$469, DW_AT_TI_symbol_name("_PCR")
	.dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$470	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$470, DW_AT_name("CFG")
	.dwattr $C$DW$470, DW_AT_TI_symbol_name("_CFG")
	.dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$471	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$471, DW_AT_name("START")
	.dwattr $C$DW$471, DW_AT_TI_symbol_name("_START")
	.dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$472	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$472, DW_AT_name("RPT")
	.dwattr $C$DW$472, DW_AT_TI_symbol_name("_RPT")
	.dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$473	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$473, DW_AT_name("PER")
	.dwattr $C$DW$473, DW_AT_TI_symbol_name("_PER")
	.dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$474	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$474, DW_AT_name("PH1D")
	.dwattr $C$DW$474, DW_AT_TI_symbol_name("_PH1D")
	.dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$50

$C$DW$T$225	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_PwmRegs")
	.dwattr $C$DW$T$225, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$T$225, DW_AT_language(DW_LANG_C)
$C$DW$T$226	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$226, DW_AT_type(*$C$DW$T$225)
$C$DW$T$227	.dwtag  DW_TAG_pointer_type, DW_AT_type(*$C$DW$T$226)
	.dwattr $C$DW$T$227, DW_AT_address_class(0x20)
$C$DW$T$228	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_PwmRegsOvly")
	.dwattr $C$DW$T$228, DW_AT_type(*$C$DW$T$227)
	.dwattr $C$DW$T$228, DW_AT_language(DW_LANG_C)

$C$DW$T$55	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$55, DW_AT_byte_size(0x174)
$C$DW$475	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$475, DW_AT_name("PID")
	.dwattr $C$DW$475, DW_AT_TI_symbol_name("_PID")
	.dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$476	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$476, DW_AT_name("RSVD0")
	.dwattr $C$DW$476, DW_AT_TI_symbol_name("_RSVD0")
	.dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$477	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$477, DW_AT_name("FUSERR")
	.dwattr $C$DW$477, DW_AT_TI_symbol_name("_FUSERR")
	.dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
	.dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$478	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$478, DW_AT_name("RSTYPE")
	.dwattr $C$DW$478, DW_AT_TI_symbol_name("_RSTYPE")
	.dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0xe4]
	.dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$479	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$479, DW_AT_name("RSTDEF")
	.dwattr $C$DW$479, DW_AT_TI_symbol_name("_RSTDEF")
	.dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
	.dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$480	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$480, DW_AT_name("RSVD1")
	.dwattr $C$DW$480, DW_AT_TI_symbol_name("_RSVD1")
	.dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
	.dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$481	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$481, DW_AT_name("PLLCTL")
	.dwattr $C$DW$481, DW_AT_TI_symbol_name("_PLLCTL")
	.dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
	.dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$482	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$482, DW_AT_name("OCSEL")
	.dwattr $C$DW$482, DW_AT_TI_symbol_name("_OCSEL")
	.dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
	.dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$483	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$483, DW_AT_name("SECCTL")
	.dwattr $C$DW$483, DW_AT_TI_symbol_name("_SECCTL")
	.dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x108]
	.dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$484	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$484, DW_AT_name("RSVD2")
	.dwattr $C$DW$484, DW_AT_TI_symbol_name("_RSVD2")
	.dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x10c]
	.dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$485	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$485, DW_AT_name("PLLM")
	.dwattr $C$DW$485, DW_AT_TI_symbol_name("_PLLM")
	.dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x110]
	.dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$486	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$486, DW_AT_name("PREDIV")
	.dwattr $C$DW$486, DW_AT_TI_symbol_name("_PREDIV")
	.dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x114]
	.dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$487	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$487, DW_AT_name("PLLDIV1")
	.dwattr $C$DW$487, DW_AT_TI_symbol_name("_PLLDIV1")
	.dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x118]
	.dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$488	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$488, DW_AT_name("PLLDIV2")
	.dwattr $C$DW$488, DW_AT_TI_symbol_name("_PLLDIV2")
	.dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x11c]
	.dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$489	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$489, DW_AT_name("PLLDIV3")
	.dwattr $C$DW$489, DW_AT_TI_symbol_name("_PLLDIV3")
	.dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x120]
	.dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$490	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$490, DW_AT_name("OSCDIV1")
	.dwattr $C$DW$490, DW_AT_TI_symbol_name("_OSCDIV1")
	.dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x124]
	.dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$491	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$491, DW_AT_name("POSTDIV")
	.dwattr $C$DW$491, DW_AT_TI_symbol_name("_POSTDIV")
	.dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x128]
	.dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$492	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$492, DW_AT_name("BPDIV")
	.dwattr $C$DW$492, DW_AT_TI_symbol_name("_BPDIV")
	.dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x12c]
	.dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$493	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$493, DW_AT_name("WAKEUP")
	.dwattr $C$DW$493, DW_AT_TI_symbol_name("_WAKEUP")
	.dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x130]
	.dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$494	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$494, DW_AT_name("RSVD3")
	.dwattr $C$DW$494, DW_AT_TI_symbol_name("_RSVD3")
	.dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x134]
	.dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$495	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$495, DW_AT_name("PLLCMD")
	.dwattr $C$DW$495, DW_AT_TI_symbol_name("_PLLCMD")
	.dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x138]
	.dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$496	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$496, DW_AT_name("PLLSTAT")
	.dwattr $C$DW$496, DW_AT_TI_symbol_name("_PLLSTAT")
	.dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x13c]
	.dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$497	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$497, DW_AT_name("ALNCTL")
	.dwattr $C$DW$497, DW_AT_TI_symbol_name("_ALNCTL")
	.dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x140]
	.dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$498	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$498, DW_AT_name("DCHANGE")
	.dwattr $C$DW$498, DW_AT_TI_symbol_name("_DCHANGE")
	.dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x144]
	.dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$499	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$499, DW_AT_name("CKEN")
	.dwattr $C$DW$499, DW_AT_TI_symbol_name("_CKEN")
	.dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x148]
	.dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$500	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$500, DW_AT_name("CKSTAT")
	.dwattr $C$DW$500, DW_AT_TI_symbol_name("_CKSTAT")
	.dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x14c]
	.dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$501	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$501, DW_AT_name("SYSTAT")
	.dwattr $C$DW$501, DW_AT_TI_symbol_name("_SYSTAT")
	.dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x150]
	.dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$502	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$502, DW_AT_name("RSVD4")
	.dwattr $C$DW$502, DW_AT_TI_symbol_name("_RSVD4")
	.dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x154]
	.dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$503	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$503, DW_AT_name("PLLDIV4")
	.dwattr $C$DW$503, DW_AT_TI_symbol_name("_PLLDIV4")
	.dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x160]
	.dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$504	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$504, DW_AT_name("PLLDIV5")
	.dwattr $C$DW$504, DW_AT_TI_symbol_name("_PLLDIV5")
	.dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x164]
	.dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$505	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$505, DW_AT_name("PLLDIV6")
	.dwattr $C$DW$505, DW_AT_TI_symbol_name("_PLLDIV6")
	.dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x168]
	.dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$506	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$506, DW_AT_name("PLLDIV7")
	.dwattr $C$DW$506, DW_AT_TI_symbol_name("_PLLDIV7")
	.dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x16c]
	.dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$507	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$507, DW_AT_name("PLLDIV8")
	.dwattr $C$DW$507, DW_AT_TI_symbol_name("_PLLDIV8")
	.dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x170]
	.dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$55

$C$DW$T$229	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_PllcRegs")
	.dwattr $C$DW$T$229, DW_AT_type(*$C$DW$T$55)
	.dwattr $C$DW$T$229, DW_AT_language(DW_LANG_C)
$C$DW$T$230	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$230, DW_AT_type(*$C$DW$T$229)
$C$DW$T$231	.dwtag  DW_TAG_pointer_type, DW_AT_type(*$C$DW$T$230)
	.dwattr $C$DW$T$231, DW_AT_address_class(0x20)
$C$DW$T$232	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_PllcRegsOvly")
	.dwattr $C$DW$T$232, DW_AT_type(*$C$DW$T$231)
	.dwattr $C$DW$T$232, DW_AT_language(DW_LANG_C)

$C$DW$T$56	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$56, DW_AT_byte_size(0x28)
$C$DW$508	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$508, DW_AT_name("DIR")
	.dwattr $C$DW$508, DW_AT_TI_symbol_name("_DIR")
	.dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$509	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$509, DW_AT_name("OUT_DATA")
	.dwattr $C$DW$509, DW_AT_TI_symbol_name("_OUT_DATA")
	.dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$510	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$510, DW_AT_name("SET_DATA")
	.dwattr $C$DW$510, DW_AT_TI_symbol_name("_SET_DATA")
	.dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$511	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$511, DW_AT_name("CLR_DATA")
	.dwattr $C$DW$511, DW_AT_TI_symbol_name("_CLR_DATA")
	.dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$512	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$512, DW_AT_name("IN_DATA")
	.dwattr $C$DW$512, DW_AT_TI_symbol_name("_IN_DATA")
	.dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$513	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$513, DW_AT_name("SET_RIS_TRIG")
	.dwattr $C$DW$513, DW_AT_TI_symbol_name("_SET_RIS_TRIG")
	.dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$514	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$514, DW_AT_name("CLR_RIS_TRIG")
	.dwattr $C$DW$514, DW_AT_TI_symbol_name("_CLR_RIS_TRIG")
	.dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$515	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$515, DW_AT_name("SET_FAL_TRIG")
	.dwattr $C$DW$515, DW_AT_TI_symbol_name("_SET_FAL_TRIG")
	.dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$516	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$516, DW_AT_name("CLR_FAL_TRIG")
	.dwattr $C$DW$516, DW_AT_TI_symbol_name("_CLR_FAL_TRIG")
	.dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$517	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$517, DW_AT_name("INTSTAT")
	.dwattr $C$DW$517, DW_AT_TI_symbol_name("_INTSTAT")
	.dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$56

$C$DW$T$57	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_GpioBankRegs")
	.dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
	.dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)

$C$DW$T$58	.dwtag  DW_TAG_array_type, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$58, DW_AT_byte_size(0x78)
$C$DW$518	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$518, DW_AT_upper_bound(0x02)
	.dwendtag $C$DW$T$58


$C$DW$T$59	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$59, DW_AT_byte_size(0x88)
$C$DW$519	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$519, DW_AT_name("PID")
	.dwattr $C$DW$519, DW_AT_TI_symbol_name("_PID")
	.dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$520	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$520, DW_AT_name("PCR")
	.dwattr $C$DW$520, DW_AT_TI_symbol_name("_PCR")
	.dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$521	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$521, DW_AT_name("BINTEN")
	.dwattr $C$DW$521, DW_AT_TI_symbol_name("_BINTEN")
	.dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$522	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$522, DW_AT_name("RSVD0")
	.dwattr $C$DW$522, DW_AT_TI_symbol_name("_RSVD0")
	.dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$523	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$58)
	.dwattr $C$DW$523, DW_AT_name("BANK")
	.dwattr $C$DW$523, DW_AT_TI_symbol_name("_BANK")
	.dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$59

$C$DW$T$233	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_GpioRegs")
	.dwattr $C$DW$T$233, DW_AT_type(*$C$DW$T$59)
	.dwattr $C$DW$T$233, DW_AT_language(DW_LANG_C)
$C$DW$T$234	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$234, DW_AT_type(*$C$DW$T$233)
$C$DW$T$235	.dwtag  DW_TAG_pointer_type, DW_AT_type(*$C$DW$T$234)
	.dwattr $C$DW$T$235, DW_AT_address_class(0x20)
$C$DW$T$236	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_GpioRegsOvly")
	.dwattr $C$DW$T$236, DW_AT_type(*$C$DW$T$235)
	.dwattr $C$DW$T$236, DW_AT_language(DW_LANG_C)

$C$DW$T$61	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$61, DW_AT_byte_size(0x90)
$C$DW$524	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$524, DW_AT_name("ERCSR")
	.dwattr $C$DW$524, DW_AT_TI_symbol_name("_ERCSR")
	.dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$525	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$525, DW_AT_name("AWCCR")
	.dwattr $C$DW$525, DW_AT_TI_symbol_name("_AWCCR")
	.dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$526	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$526, DW_AT_name("SDBCR")
	.dwattr $C$DW$526, DW_AT_TI_symbol_name("_SDBCR")
	.dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$527	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$527, DW_AT_name("SDRCR")
	.dwattr $C$DW$527, DW_AT_TI_symbol_name("_SDRCR")
	.dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$528	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$528, DW_AT_name("AB1CR")
	.dwattr $C$DW$528, DW_AT_TI_symbol_name("_AB1CR")
	.dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$529	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$529, DW_AT_name("AB2CR")
	.dwattr $C$DW$529, DW_AT_TI_symbol_name("_AB2CR")
	.dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$530	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$530, DW_AT_name("AB3CR")
	.dwattr $C$DW$530, DW_AT_TI_symbol_name("_AB3CR")
	.dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$531	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$531, DW_AT_name("AB4CR")
	.dwattr $C$DW$531, DW_AT_TI_symbol_name("_AB4CR")
	.dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$532	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$532, DW_AT_name("SDTIMR")
	.dwattr $C$DW$532, DW_AT_TI_symbol_name("_SDTIMR")
	.dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$533	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$533, DW_AT_name("DDRSR")
	.dwattr $C$DW$533, DW_AT_TI_symbol_name("_DDRSR")
	.dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$534	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$534, DW_AT_name("DDRPHYCR")
	.dwattr $C$DW$534, DW_AT_TI_symbol_name("_DDRPHYCR")
	.dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$535	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$535, DW_AT_name("DDRPHYSR")
	.dwattr $C$DW$535, DW_AT_TI_symbol_name("_DDRPHYSR")
	.dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$536	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$536, DW_AT_name("TOTAR")
	.dwattr $C$DW$536, DW_AT_TI_symbol_name("_TOTAR")
	.dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$537	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$537, DW_AT_name("TOTACTR")
	.dwattr $C$DW$537, DW_AT_TI_symbol_name("_TOTACTR")
	.dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$538	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$538, DW_AT_name("DDRPHYID_REV")
	.dwattr $C$DW$538, DW_AT_TI_symbol_name("_DDRPHYID_REV")
	.dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$539	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$539, DW_AT_name("SDSRETR")
	.dwattr $C$DW$539, DW_AT_TI_symbol_name("_SDSRETR")
	.dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$540	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$540, DW_AT_name("EIRR")
	.dwattr $C$DW$540, DW_AT_TI_symbol_name("_EIRR")
	.dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$541	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$541, DW_AT_name("EIMR")
	.dwattr $C$DW$541, DW_AT_TI_symbol_name("_EIMR")
	.dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$542	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$542, DW_AT_name("EIMSR")
	.dwattr $C$DW$542, DW_AT_TI_symbol_name("_EIMSR")
	.dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$543	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$543, DW_AT_name("EIMCR")
	.dwattr $C$DW$543, DW_AT_TI_symbol_name("_EIMCR")
	.dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
	.dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$544	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$544, DW_AT_name("IOCTRLR")
	.dwattr $C$DW$544, DW_AT_TI_symbol_name("_IOCTRLR")
	.dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$545	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$545, DW_AT_name("IOSTATR")
	.dwattr $C$DW$545, DW_AT_TI_symbol_name("_IOSTATR")
	.dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
	.dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$546	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$546, DW_AT_name("NANDFCR")
	.dwattr $C$DW$546, DW_AT_TI_symbol_name("_NANDFCR")
	.dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
	.dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$547	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$547, DW_AT_name("NANDFSR")
	.dwattr $C$DW$547, DW_AT_TI_symbol_name("_NANDFSR")
	.dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
	.dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$548	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$548, DW_AT_name("RSVD1")
	.dwattr $C$DW$548, DW_AT_TI_symbol_name("_RSVD1")
	.dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
	.dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$549	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$549, DW_AT_name("NANDF1ECC")
	.dwattr $C$DW$549, DW_AT_TI_symbol_name("_NANDF1ECC")
	.dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
	.dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$550	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$550, DW_AT_name("NANDF2ECC")
	.dwattr $C$DW$550, DW_AT_TI_symbol_name("_NANDF2ECC")
	.dwattr $C$DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
	.dwattr $C$DW$550, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$551	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$551, DW_AT_name("NANDF3ECC")
	.dwattr $C$DW$551, DW_AT_TI_symbol_name("_NANDF3ECC")
	.dwattr $C$DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
	.dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$552	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$552, DW_AT_name("NANDF4ECC")
	.dwattr $C$DW$552, DW_AT_TI_symbol_name("_NANDF4ECC")
	.dwattr $C$DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
	.dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$553	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$553, DW_AT_name("IODFTECR")
	.dwattr $C$DW$553, DW_AT_TI_symbol_name("_IODFTECR")
	.dwattr $C$DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
	.dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$554	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$554, DW_AT_name("IODFTGCR")
	.dwattr $C$DW$554, DW_AT_TI_symbol_name("_IODFTGCR")
	.dwattr $C$DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
	.dwattr $C$DW$554, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$555	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$555, DW_AT_name("IODFTMRLR")
	.dwattr $C$DW$555, DW_AT_TI_symbol_name("_IODFTMRLR")
	.dwattr $C$DW$555, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
	.dwattr $C$DW$555, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$556	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$556, DW_AT_name("IODFTMRMR")
	.dwattr $C$DW$556, DW_AT_TI_symbol_name("_IODFTMRMR")
	.dwattr $C$DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
	.dwattr $C$DW$556, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$557	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$557, DW_AT_name("IODFTMRMSBR")
	.dwattr $C$DW$557, DW_AT_TI_symbol_name("_IODFTMRMSBR")
	.dwattr $C$DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
	.dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$558	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$558, DW_AT_name("MODRNR")
	.dwattr $C$DW$558, DW_AT_TI_symbol_name("_MODRNR")
	.dwattr $C$DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0x8c]
	.dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$61

$C$DW$T$237	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_EmifRegs")
	.dwattr $C$DW$T$237, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$T$237, DW_AT_language(DW_LANG_C)
$C$DW$T$238	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$238, DW_AT_type(*$C$DW$T$237)
$C$DW$T$239	.dwtag  DW_TAG_pointer_type, DW_AT_type(*$C$DW$T$238)
	.dwattr $C$DW$T$239, DW_AT_address_class(0x20)
$C$DW$T$240	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_EmifRegsOvly")
	.dwattr $C$DW$T$240, DW_AT_type(*$C$DW$T$239)
	.dwattr $C$DW$T$240, DW_AT_language(DW_LANG_C)

$C$DW$T$64	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$64, DW_AT_byte_size(0xe8)
$C$DW$559	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$559, DW_AT_name("REVID")
	.dwattr $C$DW$559, DW_AT_TI_symbol_name("_REVID")
	.dwattr $C$DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$560	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$560, DW_AT_name("CTRL")
	.dwattr $C$DW$560, DW_AT_TI_symbol_name("_CTRL")
	.dwattr $C$DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$560, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$561	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$561, DW_AT_name("STAT")
	.dwattr $C$DW$561, DW_AT_TI_symbol_name("_STAT")
	.dwattr $C$DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$561, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$562	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$562, DW_AT_name("INTPRI")
	.dwattr $C$DW$562, DW_AT_TI_symbol_name("_INTPRI")
	.dwattr $C$DW$562, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$562, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$563	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$563, DW_AT_name("INTSTATCLR")
	.dwattr $C$DW$563, DW_AT_TI_symbol_name("_INTSTATCLR")
	.dwattr $C$DW$563, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$563, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$564	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$564, DW_AT_name("INTPENDSET")
	.dwattr $C$DW$564, DW_AT_TI_symbol_name("_INTPENDSET")
	.dwattr $C$DW$564, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$564, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$565	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$565, DW_AT_name("INTPTR")
	.dwattr $C$DW$565, DW_AT_TI_symbol_name("_INTPTR")
	.dwattr $C$DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$565, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$566	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$566, DW_AT_name("XAM")
	.dwattr $C$DW$566, DW_AT_TI_symbol_name("_XAM")
	.dwattr $C$DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$566, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$567	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$567, DW_AT_name("RAMS1")
	.dwattr $C$DW$567, DW_AT_TI_symbol_name("_RAMS1")
	.dwattr $C$DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$567, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$568	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$568, DW_AT_name("RAMO1")
	.dwattr $C$DW$568, DW_AT_TI_symbol_name("_RAMO1")
	.dwattr $C$DW$568, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$568, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$569	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$569, DW_AT_name("RAMS2")
	.dwattr $C$DW$569, DW_AT_TI_symbol_name("_RAMS2")
	.dwattr $C$DW$569, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$569, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$570	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$570, DW_AT_name("RAMO2")
	.dwattr $C$DW$570, DW_AT_TI_symbol_name("_RAMO2")
	.dwattr $C$DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$570, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$571	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$571, DW_AT_name("RAMS3")
	.dwattr $C$DW$571, DW_AT_TI_symbol_name("_RAMS3")
	.dwattr $C$DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$571, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$572	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$572, DW_AT_name("RAMO3")
	.dwattr $C$DW$572, DW_AT_TI_symbol_name("_RAMO3")
	.dwattr $C$DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$572, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$573	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$573, DW_AT_name("RAMS4")
	.dwattr $C$DW$573, DW_AT_TI_symbol_name("_RAMS4")
	.dwattr $C$DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$573, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$574	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$574, DW_AT_name("RAMO4")
	.dwattr $C$DW$574, DW_AT_TI_symbol_name("_RAMO4")
	.dwattr $C$DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$574, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$575	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$575, DW_AT_name("CHIPVER")
	.dwattr $C$DW$575, DW_AT_TI_symbol_name("_CHIPVER")
	.dwattr $C$DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$575, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$576	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$576, DW_AT_name("AUTNGO")
	.dwattr $C$DW$576, DW_AT_TI_symbol_name("_AUTNGO")
	.dwattr $C$DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$576, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$577	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$577, DW_AT_name("MANNGO")
	.dwattr $C$DW$577, DW_AT_TI_symbol_name("_MANNGO")
	.dwattr $C$DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$578	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$578, DW_AT_name("NGOSTAT")
	.dwattr $C$DW$578, DW_AT_TI_symbol_name("_NGOSTAT")
	.dwattr $C$DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
	.dwattr $C$DW$578, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$579	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$62)
	.dwattr $C$DW$579, DW_AT_name("RSVD0")
	.dwattr $C$DW$579, DW_AT_TI_symbol_name("_RSVD0")
	.dwattr $C$DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$579, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$580	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$580, DW_AT_name("INTVEC0")
	.dwattr $C$DW$580, DW_AT_TI_symbol_name("_INTVEC0")
	.dwattr $C$DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
	.dwattr $C$DW$580, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$581	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$581, DW_AT_name("INTVEC1")
	.dwattr $C$DW$581, DW_AT_TI_symbol_name("_INTVEC1")
	.dwattr $C$DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
	.dwattr $C$DW$581, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$582	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$63)
	.dwattr $C$DW$582, DW_AT_name("RSVD1")
	.dwattr $C$DW$582, DW_AT_TI_symbol_name("_RSVD1")
	.dwattr $C$DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
	.dwattr $C$DW$582, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$583	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$583, DW_AT_name("RREVID")
	.dwattr $C$DW$583, DW_AT_TI_symbol_name("_RREVID")
	.dwattr $C$DW$583, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
	.dwattr $C$DW$583, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$584	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$584, DW_AT_name("RCTRL")
	.dwattr $C$DW$584, DW_AT_TI_symbol_name("_RCTRL")
	.dwattr $C$DW$584, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
	.dwattr $C$DW$584, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$585	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$585, DW_AT_name("RSTAT")
	.dwattr $C$DW$585, DW_AT_TI_symbol_name("_RSTAT")
	.dwattr $C$DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
	.dwattr $C$DW$585, DW_AT_accessibility(DW_ACCESS_public)
